Repository: 84000/data-translation-memory
Catalog: toh266-v3.tmx
Source language: bo
Languages: en

source: ཤཱ་རིའི་བུ་གང་དེ་བཞིན་གཤེགས་པ་མང་པོའི་བླ་མའི་མཚན་ལྷའམ། ཀླུའམ། གནོད་སྦྱིན་ནམ། མིའམ། མི་མ་ཡིན་པ་ཉན་པར་འགྱུར་བ་དེ་ཉིད་དེ་དག་ཐམས་ཅད་ཀྱི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྒྱུར་འགྱུར་རོ།
en: Śāriputra, for those who hear the name of the thus-gone one Guru of Many, be they gods, nāgas, yakṣas, humans, or nonhumans, just hearing that will be the cause for them all to attain unexcelled, perfect and complete awakening.

source: །དེ་དག་གིས་བསྐལ་པ་སུམ་ཅུར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: In thirty eons those beings will turn away from saṃsāra.

source: །གང་དག་མཚན་འདི་ལ་དད་པར་མི་བྱེད་པ་དེ་དག་ནི་བསྐལ་པ་ཉི་ཤུ་དང་ལོ་སྟོང་དུ་དམྱལ་བར་བཙོ་བར་འགྱུར་རོ།
en: Those who do not give rise to faith in this name will roast in the hells for twenty eons and a thousand years.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ལྔ་སྟོང་ན་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་སྣ་བདུན་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མའི་སྡེ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Five thousand buddhafields away, in the world system called Seven Precious Substances , dwells the thus-gone one, the worthy one, the completely perfect buddha called Lotus Commander.

source: ཤཱ་རིའི་བུ་གང་དག་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེས་རབ་ཏུ་གང་བར་བྱས་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཉིན་རེ་ཞིང་སྦྱིན་པ་ཕུལ་ལ་དེ་བཞིན་དུ་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དང་མཉམ་པར་སྦྱིན་པ་ཕུལ་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གིས་རིན་པོ་ཆེ་འདི་ཡོངས་སུ་བཏང་བ་འདིས་དེ་བཞིན་གཤེགས་པ་པད་མའི་སྡེ་དེའི་མཚན་ཐོས་པར་གྱུར་ཅིག་སྙམ་སྟེ། གང་སངས་རྒྱས་མཐོང་བ་དེ་དག་གིས་ཐོས་པར་ནུས་སོ།
en: Śāriputra, those who fill the entire trigalactic megagalactic world system with jewels and offer it every day to the blessed buddhas for as many eons as there are grains of sand in the Ganges River with the thought, ‘By means of giving away these jewels, may I hear the name of the thus-gone one Lotus Commander!’ will see the buddha and thus be able to hear his name.

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དེ་ནི་སྤྱོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལས་ངེས་པར་བྱུང་བ་སྟེ། གང་དག་དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་ཉན་པར་འགྱུར་བ་དང་། དད་པ་ཡང་སྐྱེད་པར་འགྱུར་བ་དེ་དག་ནི་པད་མ་ཆུ་ལས་བྱུང་བ་བཞིན་ཁམས་གསུམ་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པར་འགྱུར་རོ།
en: Śāriputra, it is because that thus-gone one has reached deliverance through inconceivable conduct, such that those who hear his name and give rise to faith will, as a lotus arises from water, rise above the three worlds entirely.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་སུམ་ཅུ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཟླ་བ་ཅན་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མོའི་དབྱངས་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Thirty thousand buddhafields from here, in the world system Endowed with Moon, dwells the thus-gone one, the worthy one, the completely perfect buddha called Melody of a Lotus

source: ཤཱ་རིའི་བུ་དེ་ཡིད་ལ་ཇི་སྙམ་དུ་སེམས་ཅིའི་ཕྱིར་པད་མོའི་དབྱངས་ཞེས་བྱ་ཞེ་ན།
en: Śāriputra, why do you think he is called Melody of a Lotus

source: དེ་བཞིན་གཤེགས་པ་དེ་པད་མ་ལ་བཞུགས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དང་། སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱིས་ཀྱེ་མ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མོའི་དབྱངས་བྱུང་ངོ་ཞེས་སྒྲ་བསྒྲགས་སོ།
en: It is because that thus-gone one perfectly awakened to unexcelled, perfect and complete awakening while seated on a lotus, whereupon the gods of the Heaven of the Thirty-Three exclaimed, ‘Hurray, a thus-gone one, a worthy one, a completely perfect buddha—the melody of a lotus—has appeared!’

source: །ཤཱ་རིའི་བུ་གང་དེ་བཞིན་གཤེགས་པ་པད་མོའི་དབྱངས་ཀྱི་མཚན་ཉན་པ་དང་། དད་པ་སྐྱེད་པར་འགྱུར་བ་དང་། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ཚིག་དེ་སྐད་དུ་སྨྲ་ན།
en: “Śāriputra, all those who hear the name of the thus-gone one Melody of a Lotus , give rise to faith, and say, kneeling on their right knees, ‘Homage to the thus-gone one!’ will possess the quality of not falling into negative rebirths;

source: མཚམས་མེད་པ་ལས་བྱུང་བ་དང་། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ་མ་གཏོགས་པར་དེ་དག་ཐམས་ཅད་ལོག་པར་མི་ལྟུང་བའི་ཆོས་ཅན་དུ་འགྱུར་རོ།
en: that is, unless they have committed actions with immediate retribution and disparaged the noble ones.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་སུམ་ཅུ་ན་འཇིག་རྟེན་གྱི་ཁམས་མཐུ་བོ་ཆེ་དང་ལྡན་པའི་ས་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་མང་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Thirty thousand buddhafields from here, in the world system Place Endowed with Great Power, dwells the thus-gone one, the worthy one, the completely perfect buddha called Myriad Jewels.

source: ཅིའི་ཕྱིར་རིན་ཆེན་མང་ཞེས་བྱ་ཞེ་ན།
en: Śāriputra, why do you think he is called Myriad Jewels?

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤིན་ཏུ་མང་སྟེ། ཉན་ཐོས་ཀྱི་ཐེག་པ་ཅན་མང་བ་མ་ཡིན་ལ་ཉིན་རེ་ཞིང་ཡང་དེའི་བསྟན་པ་ཚད་མེད་པར་ཕྱུང་སྟེ།
en: In that buddhafield there is a great many bodhisattvas and few followers of the Vehicle of Hearers, and every day he reveals infinite teachings for them.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེ་རིན་ཆེན་མང་ཞེས་བྱའོ།
en: That is why that thus-gone one is called Myriad Jewels.

source: །ཤཱ་རིའི་བུ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། ཐལ་མོ་སྦྱར་ནས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་མང་དེ་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ཆེད་དུ་བརྗོད་པ་ལན་གསུམ་དུ་རྗོད་པར་བྱེད་ན། དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་སྨོན་ལམ་གྱི་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ། དེ་ནི་གཡོག་རིན་པོ་ཆེ་དང་ལྡན་པར་འགྱུར་རོ།
en: Śāriputra, if any son or daughter of noble family kneels on his or her right knee and, with palms joined, repeats three times the joyous utterance, ‘Homage to the thus-gone one Myriad Jewels!’ he or she will perfect the conduct connected to that thus-gone one’s previous aspiration and become a servant endowed with jewels

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་ཉི་ཤུ་ན་འཇིག་རྟེན་གྱི་ཁམས་མེ་ཏོག་ཅན་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སེང་གེའི་ང་རོ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Twenty thousand buddhafields away, in the world system called Endowed with Flowers, dwells the thus-gone one, the worthy one, the completely perfect buddha called Lion’s Roar

source: ཤཱ་རིའི་བུ་གང་དག་དེ་བཞིན་གཤེགས་པ་སེང་གེའི་ང་རོའི་མཚན་ཉན་པ་དང་། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སེང་གེའི་ང་རོ་དེ་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ཆེད་དུ་བརྗོད་པ་ལན་གསུམ་དུ་རྗོད་པར་བྱེད་ན། དེ་དག་ཐམས་ཅད་སེམས་ཅན་ཐམས་ཅད་དགྲོལ་བའི་ཕྱིར་འཇིག་རྟེན་གསུམ་ཟིལ་གྱིས་མནན་ནས་སེང་གེའི་སྒྲར་སྒྲོགས་སོ།
en: Śāriputra, if those who hear the name of the thus-gone one Lion’s Roar kneel on their right knees and repeat three times the joyous utterance, ‘Homage to the thus-gone one, the worthy one, the completely perfect buddha Lion’s Roar !’ they will all roar the lion’s roar, overwhelming the three worlds in order to liberate all beings.

source: །བསྐལ་པ་ལྔར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: In five eons, they will turn away from saṃsāra.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅུ་ན་འཇིག་རྟེན་གྱི་ཁམས་དགོན་པ་ཅན་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སེང་གེའི་དབྱངས་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Ten thousand buddhafields away, in the world system called Endowed with Wilderness, dwells the thus-gone one, the worthy one, the completely perfect buddha called Lion’s Melody.

source: ཤཱ་རིའི་བུ་གང་དེ་བཞིན་གཤེགས་པ་སེང་གེའི་དབྱངས་ལ་རྗེས་སུ་དྲན་པར་བྱེད་ཅིང་ཐ་ན་ནམ་མཁའ་ལ་ཡང་མེ་ཏོག་གིས་འཐོར་བ་དང་། གང་གིས་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་བཙུགས་ནས་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་མཆོད་པར་གྱུར་ཅིག་ཅེས་མོས་པ་ལྟ་ཅི་སྨོས་ཏེ། དེ་དག་ཐམས་ཅད་འཇིག་རྟེན་ན་མེ་ཏོག་ལྟ་བུར་འགྱུར་རོ།
en: Śāriputra, those who recollect the thus-gone one Lion’s Melody and simply toss a flower in the sky—let alone worship him by erecting a stūpa for him and making offerings—will all become like flowers in the world.

source: །གསུང་དབྱངས་དེ་ཐོབ་པར་འགྱུར་ཏེ་དེ་ནི་སངས་རྒྱས་ཀྱི་གསུང་དབྱངས་སོ།
en: They will acquire a melodious voice, which is the melodious voice of buddhas.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅྭ་ལྔ་ན་འཇིག་རྟེན་གྱི་ཁམས་མྱ་ངན་མེད་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དཔའ་བོའི་སྡེ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Fifteen thousand buddhafields away, in the world system called Devoid of Sorrow, dwells the thus-gone one, the worthy one, the completely perfect buddha called Leader of Heroes.

source: ཤཱ་རིའི་བུ་གང་དེ་བཞིན་གཤེགས་པ་དཔའ་བོའི་སྡེའི་མཚན་ཉན་པ་དང་། དད་པ་སྐྱེད་པར་འགྱུར་བ་དང་། ལྷག་པའི་བསམ་པས་འཇིག་རྟེན་གྱི་ཁམས་མྱ་ངན་མེད་པ་ལ་ཡང་མོས་པར་བྱེད་པ་དང་། དེ་བཞིན་གཤེགས་པ་དེ་ལ་ལྷག་པའི་བསམ་པས་སེམས་བསྐྱེད་པ་ཙམ་ཡང་དད་པ་སྐྱེད་ན་དེ་དག་ཐམས་ཅད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཆོས་སྟོན་པ་མཐོང་བར་འགྱུར་རོ།
en: Śāriputra, all those who hear the name of the thus-gone one Leader of Heroes, give rise to faith, wholeheartedly long for the world system Devoid of Sorrow, and give rise to faith with only a mere thought wholeheartedly generated in relation to that thus-gone one will witness that thus-gone one teaching the Dharma.

source: བཅོམ་ལྡན་འདས་དེའི་སྔོན་གྱི་སྨོན་ལམ་གྱིས་ཏེ།
en: It is because that blessed one previously made the following aspiration:

source: འཇིག་རྟེན་གཞན་དུ་བྱང་ཆུབ་ཐོབ་པའི་མིང་ཐོས་ན་དེ་ནས་ཤི་འཕོས་ནས་དེ་དག་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་དེ་ལྟར་བཏབ་པར་གྱུར་ཏོ།
en: ‘Once I have attained awakening, may those in other world systems who hear my name, after death, be reborn in my buddhafield and perfect all the qualities of a buddha!’

source: །གང་དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་ཐོས་ནས་དད་པར་མི་བྱེད་ཅིང་སྤོང་བ་དང་། རྣ་བ་བླགས་ཏེ་ཉན་པར་མི་བྱེད་པ་དེ་དག་ནི་ལོ་བྱེ་བ་སྙེད་དུ་སེམས་ཅན་དམྱལ་བའི་ལས་ཡོངས་སུ་བཟུང་བར་འགྱུར་རོ།
en: “Those who hear the thus-gone one’s name but impiously forsake it, and those whose ears are tuned but do not listen, will incur the karma for living in the hells for as long as ten million years.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་དྲུག་ཅུའི་ཐ་མ་ན་འཇིག་རྟེན་གྱི་ཁམས་འཇམ་དབྱངས་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡང་དག་པར་བླངས་པ་ཐམས་ཅད་ལས་རྒལ་བ་ཐེ་ཙོམ་གཅོད་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Sixty thousand buddhafields away, in the world system called Gentle Voice, dwells the thus-gone one, the worthy one, the completely perfect buddha called Resolver of Doubts Regarding Transgressing All Vows.

source: ཤཱ་རིའི་བུ་གང་དེ་བཞིན་གཤེགས་པ་ཡང་དག་པར་བླངས་པ་ཐམས་ཅད་ལས་རྒལ་བ་ཐེ་ཙོམ་གཅོད་པ་དེའི་མཚན་ཉན་པ་དང་། དད་པ་སྐྱེད་པར་འགྱུར་བ་དང་། མོས་པར་བྱེད་པ་དེ་དག་ནི་གང་ཡང་དག་པར་བླངས་ནས་ཚིག་ཏུ་སྨྲ་བ་དེ་ལ་ཇི་ལྟར་སྨྲས་པ་དེ་ལྟར་བྱེད་པར་འགྱུར་རོ།
en: Śāriputra, those who hear the name of the thus-gone one Resolver of Doubts Regarding Transgressing All Vows, give rise to faith, and become devout will do exactly as proclaimed in their vows.

source: །བདུད་ཐམས་ཅད་དང་ཕ་རོལ་རྒོལ་བ་ཐམས་ཅད་བཏུལ་ནས་ཐེ་ཙོམ་ཐམས་ཅད་གཅོད་པ་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་འགྱུར་རོ།
en: Having tamed all demons and preachers of false doctrines, they will resolve all doubts and become thus-gone ones, worthy ones, completely perfect buddhas.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅྭ་བརྒྱད་ན་འཇིག་རྟེན་གྱི་ཁམས་མེ་ཏོག་གི་དྲིས་བསྒོས་པ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་རིན་པོ་ཆེ་དང་མེ་ལྟ་བུ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Eighteen thousand buddhafields away, in the world system called Infused with the Fragrance of Flowers, dwells the thus-gone one, the worthy one, the completely perfect buddha called One like a Jewel Wheel and Fire.

source: ཤཱ་རིའི་བུ་གང་དེ་བཞིན་གཤེགས་པ་འཁོར་རིན་པོ་ཆེ་དང་མེ་ལྟ་བུ་དེའི་མཚན་ཉན་པ་དང་། མཚན་ཐོས་མ་ཐག་ཏུ་དད་པ་སྐྱེད་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་འཁོར་རིན་པོ་ཆེ་དང་མེ་ལྟ་བུར་འགྱུར་ཞིང་།
en: Śāriputra, all those who hear the name of the thus-gone one One like a Jewel Wheel and Fire and give rise to faith immediately upon hearing it will become like jewel wheels and fire.

source: འཇིག་རྟེན་ལ་ཡང་ཆོས་ཀྱི་འཁོར་ལོ་མྱུར་དུ་སྐོར་བར་འགྱུར་རོ།
en: Furthermore, they will swiftly turn the wheel of the Dharma in the world.

source: །དེ་ལྟར་ན་སངས་རྒྱས་རྣམས་ལ་དད་པ་འདི་ནི་རྫུ་འཕྲུལ་ཆེ་སྟེ།
en: “Accordingly, faith in buddhas has great miraculous power.

source: དེ་དག་ཉན་ཐོས་ཀྱི་ཐེག་པས་སམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པས་སམ། བླ་ན་མེད་པའི་ཐེག་པ་ཆེན་པོས་ཀྱང་རུང་། བསོད་ནམས་ཀྱི་ཕུང་པོ་ཇི་ལྟར་བསྔོས་པ་དེ་ལྟར་འགྲུབ་སྟེ།
en: For heaps of merit will be accomplished precisely according to how beings dedicate them, whether it be through the Vehicle of Hearers, the Vehicle of Solitary Realizers, or the unexcelled Great Vehicle.

source: དེ་ལ་གང་དག་ཤེས་རབ་རྒྱ་ཆེ་བ་དེ་དག་ནི་སངས་རྒྱས་སུ་འགྲུབ་པར་བྱ་བའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་བླ་ན་མེད་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: Among them, those with more expansive insight will take up the unexcelled Great Vehicle in order to accomplish awakening.

source: །མོས་པ་དམན་པའི་ཤེས་རབ་ཅན་དག་ནི་སངས་རྒྱས་སུ་འགྲུབ་པ་ཚད་མེད་པ་དེ་ལྟ་བུ་བཏང་སྟེ། དེའི་འབྲས་བུ་འགྲུབ་པར་བྱ་བའི་ཕྱིར་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: The insightful with more meager inclinations will forgo such an immeasurable accomplishment as awakening, and take up the Vehicles of Hearers and Solitary Realizers to accomplish their results.

source: །གཏེར་ཆེན་པོ་དེ་ལྟ་བུ་རྙེད་ནས་སེར་སྣ་མི་སྐྱེད་པ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་ཡོན་ཕུལ་བ་ལ་མོས་པར་བྱས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་བསོད་ནམས་དེ་ཐམས་ཅད་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བར་བྱ་བའི་ཕྱིར།
en: When they have found such great treasures and, without stinginess, feel inclined to offer them to the Thus-Gone One, they thereby give rise to the resolve set on unexcelled, perfect and complete awakening. Their dedication of all the merit from doing so toward the welfare and happiness of all beings should be understood as amazing!

source: ཡོངས་སུ་བསྔོ་བ་འདི་ནི་ངོ་མཚར་དུ་རིག་པར་གྱིས་ཤིག །ཤཱ་རིའི་བུ་གང་དེ་བཞིན་གཤེགས་པ་དེའམ། སངས་རྒྱས་གཞན་རྣམས་ཀྱི་ཡོན་ཏན་ཡོངས་སུ་བརྗོད་པ་ལ་དད་པར་མི་བྱེད་པ་དེ་དག་ཐམས་ཅད་ལོ་སྟོང་ཕྲག་བཞི་བཅུར་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཐིག་ནག་པོར་གནས་པར་འགྱུར་རོ།
en: Śāriputra, all those who do not have faith in the virtues of that thus-gone one or other buddhas will dwell in the Black Line Hell for forty thousand years.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་དྲུག་ཅུའི་ཐ་མ་ན་འཇིག་རྟེན་གྱི་ཁམས་དགའ་བ་དང་བཅས་པར་སྐྱེད་པ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མྱ་ངན་མེད་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Sixty thousand buddhafields away, in the world system called Created with Joy, dwells the thus-gone one, the worthy one, the completely perfect buddha called Devoid of Sorrow.

source: ཤཱ་རིའི་བུ་གང་དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་ཐོས་པ་ཙམ་གྱིས་གང་དག་དགའ་བ་རབ་ཏུ་རྙེད་པ་དེ་དག་ཐམས་ཅད་ཉེ་བའི་ཉོན་མོངས་པས་མི་གོས་ཤིང་མྱ་ངན་མེད་པར་འགྱུར་རོ།
en: Śāriputra, all those who find joy by merely hearing the name of that thus-gone one will be untainted by secondary afflictions and free of sorrow.

source: །བྱང་ཆུབ་རྗེས་སུ་ཐོབ་ནས་སེམས་ཅན་མང་པོ་ཡང་མྱ་ངན་མེད་པར་བྱེད་དོ།
en: After attaining awakening, they will also free many beings from sorrow.

source: །དེ་བཞིན་གཤེགས་པ་བཞུགས་སམ། མྱ་ངན་ལས་འདས་ཀྱང་རུང་དེ་ལ་དད་པར་བྱེད་པའི་སེམས་ཅན་དེ་དག་ནི་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་མཆོག་ངོ་མཚར་དུ་གྱུར་པ་སྟེ།
en: Beings with faith in that thus-gone one, whether he still remains or has passed beyond suffering, will be amazingly superior in all the worlds.

source: དེ་དག་གིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་བཟུང་བར་འགྱུར་རོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་མི་འབྲལ་བར་འགྱུར་རོ།
en: They will acquire an immeasurable heap of merit and never part from the blessed buddhas.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅུ་བཞི་ན་འཇིག་རྟེན་གྱི་ཁམས་འཚོ་བ་དང་ལྡན་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དམ་པའི་དགའ་ལྡན་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Forty thousand buddhafields away, in the world system called Endowed with Sustenance, dwells the thus-gone one, the worthy one, the completely perfect buddha called Endowed with Sublime Happiness.

source: ཤཱ་རིའི་བུ་གང་དག་དེ་བཞིན་གཤེགས་པ་དམ་པའི་དགའ་ལྡན་དེའི་མཚན་ཉན་ཅིང་ཐོས་ནས་ཀྱང་དགའ་བ་དང་རབ་ཏུ་དགའ་བ་ཆེར་ཐོབ་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། ཐལ་མོ་སྦྱར་ནས། དེ་བཞིན་གཤེགས་པ་དམ་པའི་དགའ་ལྡན་དེ་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ཚིག་ཏུ་སྨྲ་བ་དེ་ཐམས་ཅད་ཐེག་པ་དམ་པ་འཐོབ་པར་འགྱུར་རོ། །སེམས་ཅན་མང་པོའི་དོན་ཀྱང་བྱེད་པར་འགྱུར་རོ།
en: Śāriputra, all those who hear the name of the thus-gone one Endowed with Sublime Happiness, feel joy and elation upon hearing it, and say, kneeling with their right knees on the ground and their palms joined, ‘Homage to the thus-gone one Endowed with Sublime Happiness!’ will benefit many beings.

source: །དེ་དག་ལ་ལོག་པར་ལྟུང་བའི་འཇིགས་པ་མི་འབྱུང་ངོ་།
en: They will not be afraid of falling into lower realms.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བརྒྱད་ན་འཇིག་རྟེན་གྱི་ཁམས་ཟླ་བ་སྣང་བ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དབང་པོའི་འབྱུང་གནས་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Eight thousand buddhafields away, in the world system called Light of the Moon, dwells the thus-gone one, the worthy one, the completely perfect buddha called Source of Power.

source: ཤཱ་རིའི་བུ་གང་དག་དེ་བཞིན་གཤེགས་པ་དབང་པོའི་འབྱུང་གནས་ཀྱི་མཚན་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ལས་ཉན་པ་དེ་དག་ཀྱང་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཚད་མེད་པ་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ། །མཚན་ཇི་ཙམ་དུ་བསྒྲགས་པ་ལ།
en: Śāriputra, those who successively hear the name of the thus-gone one Source of Power will obtain an immeasurable heap of merit.

source: ལྷའམ། ཀླུའམ། གནོད་སྦྱིན་ནམ། མིའམ། མི་མ་ཡིན་པ་ཉན་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཡེ་ཤེས་ཆེན་པོ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: All those who hear the resounding of the name, be they gods, nāgas, yakṣas, humans, or nonhumans, will make irreversible progress toward great wisdom.

source: །སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་གཉིས་ན་འཇིག་རྟེན་གྱི་ཁམས་སིལ་སྙན་ཐམས་ཅད་ཀུན་ནས་མཐོ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དབྱངས་ཚད་མེད་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Two trillion buddhafields away, in the world system called Superior to All Cymbals, dwells the thus-gone one, the worthy one, the completely perfect buddha called Boundless Melody.

source: ཤཱ་རིའི་བུ་གང་དག་དེ་བཞིན་གཤེགས་པ་དབྱངས་ཚད་མེད་ཀྱི་མཚན་ཉན་ཅིང་བདག་གི་དགེ་བའི་རྩ་བ་འདིས་ཡེ་ཤེས་དམ་པ་དེ་ཐོབ་པར་གྱུར་ཅིག་ཅེས་དེ་ལྟར་སེམས་པ་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འགྱུར་རོ།
en: Śāriputra, all those who hear the name of the thus-gone one Boundless Melody and think ‘By means of these virtuous roots of mine, may I obtain the highest wisdom!’ will attain unexcelled, perfect and complete awakening.

source: །འདི་ལ་དད་པར་མི་བྱེད་པ་དེ་དག་སངས་རྒྱས་ལ་མི་མཉེས་པར་བྱེད་པའི་རྣམ་པར་སྨིན་པ་སེམས་ཅན་དམྱལ་བ་ན་གནས་པའི་ལས་བྱེད་པར་འགྱུར་རོ།
en: Those who do not have faith in him create the karma for dwelling in the hells, the retribution for displeasing the buddhas.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེ་ཅིའི་ཕྱིར་སིལ་སྙན་ཐམས་ཅད་ཀུན་ནས་མཐོ་བ་ཞེས་བྱ་ཞེ་ན།
en: Why is that world system called Superior to All Cymbals?

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དབྱངས་ཚད་མེད་དེ་དགའ་ལྡན་གྱི་གནས་ནས་འཆི་འཕོ་བ་ནས་མྱ་ངན་ལས་འདའ་བ་ཆེན་པོའི་བར་དུ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་ལྷ་དང་མི་རྣམས་ཀྱི་སིལ་སྙན་དེ་དག་རབ་ཏུ་དཀྲོལ་ཅིང་བླངས་སོ། །དེའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་དེ་སིལ་སྙན་ཐམས་ཅད་ཀུན་ནས་མཐོ་བ་ཞེས་བྱའོ།
en: Śāriputra, that world system is called Superior to All Cymbals because in the interval between that thus-gone one’s death in Tuṣita and his attainment of great nirvāṇa, all the gods and humans of this trigalactic megagalactic world system held up and rang their cymbals.

source: །ཅིའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེ་དབྱངས་ཚད་མེད་ཅེས་བྱ་ཞེ་ན།
en: And why is that thus-gone one called Boundless Melody?

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དབྱངས་ཚད་མེད་དེ་ཆོས་སྟོན་པ་ན་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་ཕྲག་ཉི་ཤུ་སྙེད་དུ་དབྱངས་ཀྱིས་གོ་བར་མཛད་པས་ན། དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེ་དབྱངས་ཚད་མེད་པ་ཞེས་བྱའོ།
en: Śāriputra, it is because when the thus-gone one Boundless Melody teaches the Dharma, he conveys it in melody for as far as two thousand world systems throughout the ten directions.

source: །སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཕྲག་སུམ་བརྒྱའི་ཐ་མ་ན་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་རྒྱལ་བའི་འོད་ཅེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཅེས་བྱ་བ་བཞུགས་ཏེ།
en: “Three billion buddhafields away, in the world system called Light of Victory, dwells the thus-gone one, the worthy one, the completely perfect buddha called Dīpaṅkara.

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་དེའི་འོད་ཀྱིས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་བརྒྱ་སྟོང་ཀུན་ཏུ་འོད་ཀྱི་སྣང་བས་ཁྱབ་པས་ན་དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེ་མར་མེ་མཛད་ཅེས་བྱའོ།
en: Śāriputra, the thus-gone one Dīpaṅkara is so called because, with his light, one trillion buddhafields throughout the ten directions are flooded everywhere with dazzling radiance.

source: །ཤཱ་རིའི་བུ་གང་དག་དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་ཐོས་ནས་དད་པ་སྐྱེད་པ་དང་། དགའ་བ་དང་། རབ་ཏུ་དགའ་བ་རྒྱ་ཆེན་པོ་རྙེད་ཅིང་འབྱུང་བ་ལ་གཡོ་དང་ལྡན་པར་མི་འགྱུར་རོ།
en: Śāriputra, those who, upon hearing the name of the thus-gone one Dīpaṅkara, give rise to faith and discover and experience an ocean of joy and ecstasy will be unwavering.

source: །དེ་དག་ཐམས་ཅད་ཀྱིས་འོད་དེ་ཐོབ་པར་འགྱུར་རོ།
en: All of them will obtain that luminosity.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བརྒྱད་ཅུའི་ཕ་རོལ་ན་འཇིག་རྟེན་གྱི་ཁམས་སྤོས་ཐམས་ཅད་སྣང་བ་དང་ལྡན་པ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེ་སྣང་བ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Eighty thousand buddhafields away, in the world system called All Luminous Incenses, dwells the thus-gone one, the worthy one, the completely perfect buddha called Jewel Light.

source: ཤཱ་རིའི་བུ་གང་དག་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེ་སྣང་བ་དེའི་མཚན་ཉན་པ་དང་། ཐོས་ནས་ཀྱང་དད་པ་སྐྱེད་པར་འགྱུར་བ་དང་། ལྷག་པའི་བསམ་པས་དད་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་རིན་པོ་ཆེ་ལྟ་བུར་འགྱུར་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ལས་ཕྱིར་མི་ལྡོག་པ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་མི་འབྲལ་བར་འགྱུར་རོ།
en: Śāriputra, all those who hear the name of the thus-gone one Jewel Light and, upon hearing it, give rise to faith and become wholeheartedly devout, will become like jewels, make irreversible progress toward the qualities of a buddha, and never part from the blessed buddhas.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བསྐལ་པ་ལྔར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: They will turn away from saṃsāra in five eons while practicing the conduct of the bodhisattvas.

source: །དེ་བས་ན་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དང་། ཐེག་པ་ཆེན་པོ་ལ་ཞུགས་པའི་སྐྱེས་བུ་ཆེན་པོ་རྣམས་ལ་ཐ་བའི་ཞེ་སྡང་གི་སེམས་བསྐྱེད་པར་མི་བྱའོ།
en: “That is why, Śāriputra, one should not give rise to hostile thoughts toward thus-gone ones and toward great persons who have embarked on the Great Vehicle.

source: །ཤཱ་རིའི་བུ་གང་དག་དེ་བཞིན་གཤེགས་པ་དང་ཐེག་པ་ཆེན་པོ་ལ་ཞུགས་པའི་སྐྱེས་བུ་ཆེན་པོ་སྲས་ཐུ་བོ་པ་རྣམས་ལ་ཡིད་མི་ཆེས་པ་སྐྱེད་པ་དེ་དག་གི་ངེས་པ་ལ་ཞུགས་པ་དང་། མེ་ཏོག་གི་ཚོགས་ལ་མོས་པ་མ་གཏོགས་པར་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཉེ་བར་གྱུར་ཀྱང་རིང་དུ་བྱེད་པར་འགྱུར་རོ།
en: Śāriputra, those who do not trust their elder siblings—the thus-gone ones and the great persons who have entered the Great Vehicle—will distance themselves from the awakening of a buddha even if they have approached it; that is, unless they have secured assurance of the final attainment and have devotion for the Bouquet of Flowers

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐད་དུ་འགྲོ་བར་མི་བྱ་སྟེ།
en: They should not come in the vicinity of bodhisattva-mahāsattvas.

source: སྐྱེས་བུ་དམ་པ་དེ་དག་ལ་གནོད་སེམས་བསྐྱེད་པ་དེ་དག་ནི་ལོ་བྱེ་བར་དམྱལ་བ་ཆེན་པོའི་སྡུག་བསྔལ་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ།
en: Those who have ill will toward those sublime beings will incur the suffering of the great hells for ten million years.

source: །དུད་འགྲོའི་སྐྱེ་གནས་སུ་གྱུར་པ་ལ་ཡང་གནོད་སེམས་མི་བསྐྱེད་དོ་ཞེས་གསུངས་ན་སྐྱེས་བུ་དམ་པ་དེ་དག་ལྟ་ལ་ཅི་སྨོས།
en: If it is taught that one should not have ill will even toward those in the animal realm, how much worse would it be to have it toward those sublime beings!

source: ཤཱ་རིའི་བུ་གང་དག་སྐྱེས་བུ་ཆེན་པོ་དེ་དག་མེ་ཏོག་གི་ཚོགས་ལ་མོས་པ་དེ་དག་ལ་གནོད་པར་བྱེད་པ་དང་། ཡིད་ཆེས་པ་མི་སྐྱེད་པ་དང་། འཁྲུག་པར་བྱེད་པ་དང་། བརྙས་པར་བྱེད་པ་དེ་དག་ཐམས་ཅད་སེམས་ཅན་དམྱལ་བའི་ལས་ཤིན་ཏུ་མི་བཟད་པ་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ།
en: “Śāriputra, anyone who hurts, distrusts, disturbs, and insults those great persons with devotion for the Bouquet of Flowers will incur the terrible karma of the hells.
